package main

import "fmt"

// факториал 7! = 1 * 2 * 3 * 4 * 5 * 6 * 7 = 5040
// сумма цифр -456 = 4 + 5 + 6 = 15
func main() {
	// Вычисляет и выводит факториал числа 7 и сумму цифр числа -456
	fmt.Println(factorial(7))
	fmt.Println(sumOfDigits(-456))
}

// factorial вычисляет факториал числа n рекурсивно.
// Базовый случай: 0! = 1.
// Рекурсивный шаг: n! = n * (n-1)!
func factorial(n int) int {
	if n == 0 {
		return 1
	}
	return n * factorial(n-1)
}

// sumOfDigits вычисляет сумму цифр целого числа s рекурсивно.
// Если число отрицательное, оно преобразуется в положительное.
// Базовый случай: 0 -> сумма равна 0.
// Рекурсивный шаг: сумма цифр = последняя цифра + сумма цифр оставшейся части числа.
func sumOfDigits(s int) int {
	if s < 0 {
		s = -s
	}
	if s == 0 {
		return 0
	}
	return s%10 + sumOfDigits(s/10)
}
